#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>



//求十个整数中的最大值 
// 
//int main()
//{
//	//准备10个整数
//	//int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };//如果不是有序的，不能用二分查找
//
//	int arr[10] = { 0 };//需要指定数组元素个数， 否则根据初始化内容来推算元素个数
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//		scanf("%d", &arr[i]);
//	}//可以自定义数值
// 
//	//里面为负数也可以
//	//找出最大值-----打擂台
//	int max = arr[0];//max必须在数组中
//
//	for (i = 1; i < 10; i++)
//	{
//		if (arr[i] > max)
//		{
//			max = arr[i];
//		}
//	}
//	printf("%d\n", max);
//	return 0;
//}





//在屏幕上打印九九乘法表
//1*1=1
//2*1=2  2*2=4
//int main()
//{
//	int i = 0;
//	//打印九行
//	for (i = 1; i <= 9;i++)
//	{
//		//打印一行
//		int j = 0;
//		for(j=1;j<=i;j++)
//		    printf("%d*%d=%-2d\t", i,j,i*j);//打印两位数据，对其    -----（左对齐和右对齐）   
//		//\t----tab,更宽的空格
//
//		printf("\n");//换行
//	}
//	return 0;
//}









//函数作业

//实参和形参：
//形参是实参的一份临时拷贝，改变形参不影响实参
// 形参在函数调用的时候才实例化，才开辟内存空间
// 函数调用如果采用传值调用，改变形参不影响实参
//


//函数调用exec（(v1, v2)(v3, v4)，v5, v6)中，实参个数：4
//            逗号表达式
//                1       2      3   4



//函数尽量追求高内聚低耦合，参数不易过多
// 
//如:
//int Add(int x, int y)
//{
//	return x + y;
//}//更好
//
//int Add(int x, int y)
//{
//	int z = x + y;
//	printf("%d\n", z);
//	return z;
//}//更麻烦

//设计函数时，尽量少用全局变量，尽量做到谁申请的资源就由谁来释放

//库函数的使用必须包含对应的头文件
//main函数的位置可以任意
// 
// 
//在不同函数中可以使用相同名字的变量（互相不干扰）
//如：
//int Add(int x, int y)
//{
//	int z = x + y;
//	{
//		int num = 2022;
//	}
//	printf("%d\n", num);//不能用   -----    一个函数内复合语句中定义的变量不一定在本函数范围内有效
//	return z;
//}
//int Sub(int x, int y)
//{
//	int z = x - y;
//	return z;
//}
//z互相不干扰 ，有各自使用范围
//  
// 函数形参保存在栈中  
//栈区-----局部变量，形式参数，返回值  ----- 临时数据
//堆区-----动态内存分配，malloc free calloc realloc
// 静态区-----静态变量，全局变量
// 
// 函数的栈帧与调用
//



//实现一个函数，打印乘法口诀表，口诀表的行数和列数自己指定
//void print_table(int n)
//{
//	int i = 0;
//
//	for (i = 1; i <= n; i++)
//	{
//		int j = 0;
//		for (j = 1; j <= i; j++)
//			printf("%d*%d=%-2d\t", i, j, i * j);
//
//		printf("\n");
//	}
//}
//
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	print_table(n);
//
//	return 0;
//}




//把函数处理结果的两个数据返回给主调函数：
// 可以：1.形参用数组  如：
//void test(int arr[])
//{
//	arr[0] = 3;   //arr[0] --->*(arr+0)
//	arr[1] = 4;   //arr[1] --->*(arr+1)
//}
//int main()
//{
//	int arr[2] = { 0 };
//	test(arr);
//	return 0;
//}
//2.形参用两个指针  如：
//void test(int*px,int*py)
//{
//	*px = 3;
//	*py = 4;
//}
//int main()
//{
//	int a = 0;
//	int b = 0;
//	test(&a, &b);
//	return 0;
//}
//3.用两个全局变量
//int a = 0;
//int b = 0;
//void test()//不用传参
//{
//	a = 3;
//	b = 4;
//}
//int main()
//{
//	test();
//	printf("a=%d b=%d\n", a, b);
//	return 0;
//}
//
// ------------------------不能同时return两个数
// 



//实参和形参可以同名
//函数的数据传递可以用全局变量（只是不建议)
//主调函数和被调函数可以在不同头文件内
